In [9]:
import pandas as pd
import matplotlib
import seaborn as sns

### Полезные ссылки
* [Seaborn Introduction Guide](https://seaborn.pydata.org/tutorial/introduction.html)
* [Matplotlib Quick Start Guide](https://matplotlib.org/stable/users/explain/quick_start.html)
* [Introduction to Pandas](https://pandas.pydata.org/docs/user_guide/10min.html)

### Описание датасета

Датасет с Data Science зарплатами содержит 11 столбцов, где:

+ `work_year`: Год, когда была выплачена зарплата.

+ `experience_level`: Уровень опыта работы на данной должности в течение года

+ `employment_type`: Тип занятости для данной роли

+ `job_title`: Должность, на которой работал сотрудник в течение года.

+ `salary`: Общая сумма зарплаты GROSS
+ `salary_currency`: Валюта зарплаты в виде кода валюты ISO 4217.
+ `salaryinusd`: зарплата в долларах США. Целевая переменная.
+ `employee_residence`: Основная страна пребывания сотрудника в течение рабочего года в виде кода страны ISO 3166.
+ `remote_ratio`: Общий объем работы, выполняемой удаленно
+ `company_location`: Страна, в которой находится главный офис или филиал работодателя.
+ `company_size`: Медианное количество человек, работавших в компании в течение года

In [2]:
df = pd.read_csv('res/ds_salaries.csv')

In [8]:
# Свойство T позволяет поменять при отображении местами поля датасета и свойства, описывающие их
df.describe().T

,count,mean,std,min,25%,50%,75%,max
work_year,3755.0,2022.373635,0.691448,2020.0,2022.0,2022.0,2023.0,2023.0
salary,3755.0,190695.571771,671676.500508,6000.0,100000.0,138000.0,180000.0,30400000.0
salary_in_usd,3755.0,137570.389880,63055.625278,5132.0,95000.0,135000.0,175000.0,450000.0
remote_ratio,3755.0,46.271638,48.589050,0.0,0.0,0.0,100.0,100.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [5]:
df[:10]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
5,2023,SE,FT,Applied Scientist,222200,USD,222200,US,0,US,L
6,2023,SE,FT,Applied Scientist,136000,USD,136000,US,0,US,L
7,2023,SE,FT,Data Scientist,219000,USD,219000,CA,0,CA,M
8,2023,SE,FT,Data Scientist,141000,USD,141000,CA,0,CA,M
9,2023,SE,FT,Data Scientist,147100,USD,147100,US,0,US,M